common-sign-service/service/src/test/resources/ru/i_novus/common/sign/service/test/request/bodyOnlyRequest.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header>
        <egisz:transportHeader xmlns:egisz="http://egisz.rosminzdrav.ru">
            <egisz:authInfo>
                <egisz:clientEntityId>76c8o99n-i9si-2q3k-cagt-j</egisz:clientEntityId>
            </egisz:authInfo>
        </egisz:transportHeader>
    </soap:Header>
    <soap:Body>
        <base:sendDocument xmlns:base="http://receiver.service.nr.eu.rt.ru/" xmlns="">
            <oid>1.2.643.5.1.13.13.12.2.77.10133</oid>
            <service>person_card.list</service>
            <document>
                PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0id2luZG93cy0xMjUxIiBzdGFuZGFsb25lPSJ5ZXMiPz4NCjxwZXJzb25LZXk+DQogIDxzbmlscz4xMzM1NzYzNjA2Mzwvc25pbHM+DQo8L3BlcnNvbktleT4=
            </document>
        </base:sendDocument>
    </soap:Body>
</soap:Envelope>